[CustomEffects.A_BallistaCommander H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="弩车指挥官"
mTooltip="该英雄开局即拥有圣堂弩车单位。在该英雄的部队中，圣堂弩车获得 %buff.buff.stat %buff.buff.stat.icon 攻击。"

[CustomEffects.A_BallistaCommander_Buff H7BaseBuff]
mName="弩车指挥官"
mTooltip=""

[CustomEffects.A_BlackMarketeer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="黑市商人"
mTooltip="英雄每天为该王国随机提供 1 项稀有资源。"

[CustomEffects.A_Cautious H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="小心翼翼"
mTooltip="所有在其回合只移动而未攻击的本方生物会自动进行防御。"

[CustomEffects.A_Cautious_Buff H7BaseBuff]
mName=""
mTooltip=""

[CustomEffects.A_Charismatic H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魅力领导"
mTooltip="中立军队有 %stat1.norm 以上的机会愿意加入该英雄。中立军队愿意加入该英雄时，减少 %stat2.norm 索要的 %ICON_GOLD 黄金。"

[CustomEffects.A_Chef H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="厨艺大师"
mTooltip="本方存活的生物在每个战斗回合结束后会回复 %d.min 生命值，也能获得 %buff.buff.stat %buff.buff.stat.icon 士气。"

[CustomEffects.A_Chef_Buff H7BaseBuff]
mName="厨艺大师"
mTooltip=""

[CustomEffects.A_FeralChild H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="野性之子"
mTooltip="英雄军队中的战熊与黑熊之技能在遭受近战或者远距攻击时都会发动。"

[CustomEffects.A_FeralChild_Buff_Bear H7BaseBuff]
mName="野性之子"
mTooltip="狂野本性技能在该生物受到远程攻击时也会发动。"

[CustomEffects.A_FeralChild_Buff_BlackBear H7BaseBuff]
mName="野性之子"
mTooltip="狂野本性技能在该生物受到远程攻击时也会发动。\n狂怒技能也在该单位被近战攻击时会发动。"

[CustomEffects.A_FireHeart_Buff H7BaseBuff]
mName="火焰之心"
mTooltip=""

[CustomEffects.A_GhostConjurer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="幽灵召唤师"
mTooltip="每当本方幽灵或女妖组队至少杀死一只非亡灵体和构造体生物时，其组队的数量都会增加 %spell.spell.buff.buff.special。"

[CustomEffects.A_GhostConjurer_Buff H7BaseBuff]
mName="幽灵召唤师"
mTooltip=""

[CustomEffects.A_GhostConjurer_CReatureAbility H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[CustomEffects.A_Hotheaded H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="性情鲁莽"
mTooltip="该英雄开局即拥有森林弩车单位。在该英雄的部队中，森林弩车获得 %buff1.buff.stat %buff1.buff.stat.icon 主动性。所有本方单位在首个战斗回合中也获得 %buff2.buff.stat %buff2.buff.stat.icon 主动性。"

[CustomEffects.A_Hotheaded_Buff H7BaseBuff]
mName="性情鲁莽"
mTooltip=""

[CustomEffects.A_Hotheaded_Buff_Ballista H7BaseBuff]
mName="性情鲁莽"
mTooltip=""

[CustomEffects.A_Ingineer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="工程师"
mTooltip="英雄开局自带符文石和矮人弩炮。只要该英雄并未拥有支持或攻击作战单位，在任何战斗结束后他都会获得该矮人单位。"

[CustomEffects.A_InsatiableThirst H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="贪得无厌"
mTooltip="在该英雄部队中，吸血鬼和吸血鬼领主的生命汲取技能将回复其生命值所受到伤害的70%，而非伤害的一半。"

[CustomEffects.A_KoboldElder H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="鼠型怪长老"
mTooltip="英雄军队中的鼠型怪侦察兵与鼠型怪探路者获得 %buff.buff.stat1 %icon_destiny 幸运和 %buff.buff.stat2 %icon_morale 士气。"

[CustomEffects.A_KoboldElder_Buff H7BaseBuff]
mName="鼠型怪长老"
mTooltip=""

[CustomEffects.A_Marauder H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="掠夺者"
mTooltip="该英雄掠夺时会获得两倍资源。"

[CustomEffects.A_Pugnacious H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="好斗者"
mTooltip="每升一级，该英雄攻击时额外造成 %stat1 伤害。"

[CustomEffects.A_RuneKeeper H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="符文管理者"
mTooltip="所有本方符文光环影响 5x5 范围。"

[CustomEffects.A_Shieldmaiden H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="女盾卫"
mTooltip="英雄军队中的守卫者与盾卫者不会因任何生物攻击而无法行动。"

[CustomEffects.A_Shieldmaiden_Buff H7BaseBuff]
mName="女盾卫"
mTooltip="该生物对"无法行动"效果免疫。"

[CustomEffects.A_SpiritChanneler H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="通灵巫师"
mTooltip="该英雄每天会额外回复 %stat.norm 法力值。"

[CustomEffects.A_Vestal H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="维斯塔神官"
mTooltip="该英雄开局即拥有治疗修女单位。在该英雄的部队中，治疗修女也能治疗所有目标旁的友军单位。"

[CustomEffects.A_Vestal_Buff H7BaseBuff]
mName="维斯塔神官（增益）"
mTooltip=""

[CustomEffects.A_Vikingr H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="北方战士"
mTooltip="所有英雄军队中的守卫者、鼠型怪侦察兵、符文祭司和他们对应的升级都获得 %spell1.name 生物技能。"

[StartingAttributeIncrease.A_EagleEye H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="鹰眼"
mTooltip="英雄开局即获得 %stat 侦查范围。"

[SpellSpecializations.A_RegenerationAdept H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="回复高手"
mTooltip="该英雄开局即带有新手阶土系魔法技能和%spell1.name法术。该法施放的效果比当前该派系魔法阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

UCP 1.2 
note - many specs are originally from HeroSpecializations but updated, they can stay only here or in the original file as well (they won't be used there)

[CreatureGrowthBonus.A_MedusaQueen H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="美杜莎女王"
mTooltip="总督：城镇控制范围内的美杜莎和美杜莎女巫产量 %buff1.buff.stat。"

[CreatureGrowthBonus.A_MedusaQueen_Buff H7BaseBuff]
mName="美杜莎女王"
mTooltip=""

[MagicSchool.A_MasterOfAir H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天空门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放气系法术时。"

[MagicSchool.A_MasterOfDarkness H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="黑暗门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放暗系法术时。"

[MagicSchool.A_MasterOfEarth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放土系法术时。"

[MagicSchool.A_MasterOfFire H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="烈火门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放火系法术时。"

[MagicSchool.A_MasterOfLight H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光明门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放光系法术时。"

[MagicSchool.A_MasterOfPrime H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放源力法术时。"

[MagicSchool.A_MasterOfWater H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="万水门徒"
mTooltip="该英雄每两级获得+1 %icon_magic 魔力当施放水系法术时。"

[MightAbility.A_ArcheryMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="弓箭大师"
mTooltip="该英雄开局自带新手阶进攻技能和%spell1.name技能。\n此技能增加本方远程生物的基础伤害额外+1。"

[MightAbility.A_ArtilleryMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="炮矢大师"
mTooltip="该英雄开局自带一个战争单位，新手阶的战争技能和%spell1.name技能。\n此技能增加英雄战争单位100%生命值。"

[MightAbility.A_Catalyst H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="催化师"
mTooltip="该英雄开局自带新手阶源力魔法技能和%spell1.name能力。\n此能力在战斗后为英雄额外增加+10 %icon_mana 法力。"

[MightAbility.A_Enlightened H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="启蒙"
mTooltip="该英雄开局自带新手阶典范技能和%spell1.name能力。 \n总督：在此城镇控制范围内的所有英雄获得20%更多经验值，此外还有能力加成。"

[MightAbility.A_Explorer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="探险家"
mTooltip="该英雄开局自带新手阶探索技能和%spell1.name能力。\n总督：您的英雄在此城镇控制范围内的陆地上移动时移动速度提高10%，此外还有能力加成。"

[MightAbility.A_Frenzy H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狂怒者"
mTooltip="该英雄开局自带新手阶进攻技能和%spell1.name能力。\n此能力增加本方近战生物的基础伤害额外+1。"

[MightAbility.A_Lucky H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="幸运儿"
mTooltip="该英雄开局自带新手阶命运技能和%spell1.name能力。\n由于此能力，英雄获得两个临时的随机提升而不是一个。"

[MightAbility.A_MasterBuilder H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="建造大师"
mTooltip="该英雄开局自带新手阶经济技能和%spell1.name能力。\n总督：此城镇中建筑的黄金成本额外减少-10%。"

[MightAbility.A_MasterOfWarcries H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战嚎大师"
mTooltip="该英雄开局自带新手阶战嚎技能和%spell1.name能力。\n"前进！"战嚎增加本方生物的侧击和全力侧击伤害加成额外+25%。"

[MightAbility.A_Plenipotentiary H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="全权代表"
mTooltip="该英雄开局自带新手阶外交技能和%spell1.name能力。\n当英雄的军队包含来自不同阵营的生物时，每个生物获得额外+10 %icon_morale 士气。"

[MightAbility.A_Protector H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="守护者"
mTooltip="该英雄开局自带新手阶防御技能和%spell1.name能力。\n总督：此城镇的本地守卫核心生物容量额外增加+30，精英生物容量增加+10。"

[MightAbility.A_Seafarer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="航海家"
mTooltip="该英雄开局自带新手阶探索技能和%spell1.name能力。\n该英雄乘船航行时速度额外提高25%。"

[MightAbility.A_Tactician H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战略家"
mTooltip="该英雄开局自带新手阶领导技能和%spell1.name能力。\n由于此能力，英雄可以在前4行部署生物。"

[MightAbility.A_TreasureHunter H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寻宝猎人"
mTooltip="该英雄开局自带新手阶命运技能和%spell1.name能力。\n英雄拾取的宝箱包含额外+25%更多 %icon_Gold 黄金。"

[MightAbility.A_Vitality H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="身强力健"
mTooltip="该英雄开局自带新手阶防御技能和%spell1.name能力。\n此能力在战斗期间增加本方生物的生命值额外+2。"

[SpellSpecializations.A_BlizzardMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="风雪专家"
mTooltip="该英雄开局自带新手阶水系魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[SpellSpecializations.A_EarthquakeSpecialist_Buff_Marker H7BaseBuff]
mName="免疫地动山摇标记"
mTooltip="标记增益"

[SpellSpecializations.A_FireBallSpecialist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="连珠火球专家"
mTooltip="该英雄开局自带%spell1.name法术。\n%stat1 %ICON_MAGIC 魔力当在新手阶施放%spell1.name时，%stat2 %ICON_MAGIC 魔力在专家阶，%stat3 %ICON_MAGIC 魔力在宗师阶。"

[SpellSpecializations.A_FireBoltMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火球专家"
mTooltip="该英雄开局自带新手阶火系魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[SpellSpecializations.A_HealMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="治疗专家"
mTooltip="该英雄开局自带新手阶光系魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[SpellSpecializations.A_LightningMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="雷电专家"
mTooltip="该英雄开局自带新手阶气系魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[SpellSpecializations.A_Mad H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="疯狂"
mTooltip="该英雄开局自带%spell1.name法术并且可以在新手阶施放。施放此法术所需的法力减半。"

[SpellSpecializations.A_Mad_Frenzy_Buff H7BaseBuff]
mName="癫狂诅咒（标准）"
mTooltip=""

[SpellSpecializations.A_StoneSkinMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="石肤专家"
mTooltip="该英雄开局自带新手阶土系魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[SpellSpecializations.A_TimeMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="时间法术专家"
mTooltip="该英雄开局自带新手阶源力魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[SpellSpecializations.A_WeaknessMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="虚弱专家"
mTooltip="该英雄开局自带新手阶暗系魔法技能和%spell1.name法术。\n此法术施放时比当前该魔法派系阶层高一阶。%stat1 %ICON_MAGIC 魔力当在宗师阶施放此法术时。"

[StartingAttributeIncrease.A_AcolyteOfFortune H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="命运青睐"
mTooltip="该英雄每三级获得+2 %stat.icon 命运。"

[StartingAttributeIncrease.A_Gladiator H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="角斗士"
mTooltip="该英雄每三级获得+1 %stat.icon 力量。"

[StartingAttributeIncrease.A_NaturalBornLeader H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天生领袖"
mTooltip="该英雄每三级获得+2 %stat.icon 领导力。"

[StartingAttributeIncrease.A_Painless H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="皮糙肉厚"
mTooltip="该英雄每三级获得+1 %ICON_DEFENSE 防御。"

[StartingAttributeIncrease.A_Spellweaver H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="织法行者"
mTooltip="该英雄每三级获得+1 %stat.icon 魔力。"

[StartingAttributeIncrease.A_SpiritWalker H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="灵魂行者"
mTooltip="该英雄每级获得+5 %stat.icon 最大法力。"

[StartingAttributeIncrease.A_Terrain_Expert H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="地形专家"
mTooltip="该英雄每四级获得一个额外的移动点。"

[Unique.A_Aerial_Storm_Buff H7BaseBuff]
mName="空中风暴"
mTooltip=""

[Unique.A_AerialStorm_Ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="空中风暴"

[Unique.A_AerialStorm_Attack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="空中风暴"

[Unique.A_Archaeologist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="考古学家"
mTooltip="该英雄开局自带两个珊提瑞宝物，这些宝物无法交换。"

[Unique.A_Archaeologist_Major_OffHand_CursedDice H7HeroItem]
mName="诅咒骰子"
mTooltip="%buff1.buff.stat %buff1.buff.stat.icon 幸运对敌方生物。"

[Unique.A_Archaeologist_Major_Torso_ShantiriArmour H7HeroItem]
mName="珊提瑞护甲"
mTooltip="%stat %ICON_DEFENSE 防御\n所有本方生物受到 %buff1.buff.res1.norm 更少 %ICON_PRIME 源力伤害。"

[Unique.A_Archmage H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大法师"
mTooltip="该英雄开局自带%spell1.name能力。英雄施放的每个法术额外增加+1超魔。"

[Unique.A_Archmage_ArcaneCatalyst_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大法师"

[Unique.A_AshasWill H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="亚莎意志"
mTooltip="英雄的招魂术额外增加+%buff.buff.stat.norm。"

[Unique.A_AshasWill_Buff H7BaseBuff]
mName="亚莎意志"
mTooltip="招魂术以额外 %stat.norm 百分比点复活生物。"

[Unique.A_CelestialGuard H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天界守卫"
mTooltip="+%buff.buff.stat1.norm %buff.buff.stat1.icon 移动力和+%buff.buff.stat2.norm %buff.buff.stat2.icon 防御力对英雄军队中的所有炽天使和天界兵。"

[Unique.A_CelestialGuard_Buff H7BaseBuff]
mName="天界守卫"
mTooltip="%stat1.norm %stat1.icon 移动力和 %stat2.norm %stat2.icon 防御力"

[Unique.A_Curse H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="诅咒"
mTooltip="总督：在此城镇控制范围内的所有敌方英雄被诅咒：在此区域内的每次战斗的前3回合中，敌方英雄军队中最多三个随机生物（除了亡灵和构造体）将造成最小伤害。"

[Unique.A_Curse_Debuff H7BaseBuff]
mName="诅咒"
mTooltip="该生物造成最小伤害，持续 %durnow 回合。"

[Unique.A_Curse_HeroBuff H7BaseBuff]
mName="被诅咒"
mTooltip="在此区域内的每次战斗的前3回合中，英雄军队中最多三个随机生物（除了亡灵和构造体）将造成最小伤害。"

[Unique.A_Curse_Spell H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="诅咒"
mTooltip="目标敌方生物（除了亡灵和构造体）造成最小伤害，持续 %buff.buff.durini 回合。"

[Unique.A_DaughterOfEarth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地之女"
mTooltip="该英雄开局自带%spell1.name法术。此法术将在每次战斗开始时施放在所有本方近战生物上。"

[Unique.A_DaughterOfSky H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天空之女"
mTooltip="该英雄开局自带%spell1.name法术。此法术将在每次战斗开始时施放在所有本方远程生物上。"

[Unique.A_Dispeller H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="驱散者"
mTooltip="该英雄开局自带%spell1.name法术。此法术可以在4x4区域内施放。"

[Unique.A_DreamWalker H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="梦境行者"
mTooltip="该英雄开局自带一个追梦者单位。追梦者单位被视为该英雄的最大等级。"

[Unique.A_DruidTraveller H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="德鲁伊旅者"
mTooltip="英雄军队中的所有德鲁伊和德鲁伊长老在每次战斗中获得+%buff1.buff.stat1.norm %buff1.buff.stat1.icon 主动性和%spell2.name能力。"

[Unique.A_DruidTraveller_Buff H7BaseBuff]
mName="德鲁伊旅者"
mTooltip=""

[Unique.A_EconomicalProsperity H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="经济繁荣"
mTooltip="总督：此地下城城镇中宝物的买卖价格 %buff1.buff.stat2 更优惠。"

[Unique.A_EconomicalProsperity_Buff H7BaseBuff]
mName="经济繁荣"
mTooltip=""

[Unique.A_EternalLife H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="永恒生命"
mTooltip="任何本方生物在战斗中死亡后，将以原始数量的10%复活。每个生物只能复活一次。"

[Unique.A_EternalLife_Buff H7BaseBuff]
mName="永恒生命"
mTooltip="此生物死亡后，将以原始数量的10%复活。"

[Unique.A_EternalShadow H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="永恒暗影"
mTooltip="英雄军队中的所有生物对光系魔法免疫。"

[Unique.A_Fanaticism H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狂热"
mTooltip="英雄军队中所有生物的远程攻击从目标移除一个随机正面效果。"

[Unique.A_Fanaticism_Ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狂热"
mTooltip="此生物的远程攻击从目标移除一个随机正面效果。"

[Unique.A_Fanaticism_Buff H7BaseBuff]
mName="狂热"
mTooltip=""

[Unique.A_FatherOfGolems_Buff H7BaseBuff]
mName="魔像之父"
mTooltip="能力 %spell1.name 和 %spell2.name 没有负面效果。"

[Unique.A_Firestorm_Buff H7BaseBuff]
mName="火焰风暴"
mTooltip=""

[Unique.A_FireStorm_Master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰风暴大师"
mTooltip="所有敌方生物在每个战斗回合开始时都有25%的几率受到 %buff1.buff.d.min %buff1.buff.d.icon 火焰伤害。"

[Unique.A_GuardianOfJustice H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="正义守护者"
mTooltip="所有敌方生物有0 %icon_luck 幸运。"

[Unique.A_GuardianOfJustice_Buff H7BaseBuff]
mName="正义守护者"
mTooltip="此生物的 %icon_luck 幸运被设为0。"

[Unique.A_ImperialPresence_EnemyMarker_Buff H7BaseBuff]
mName="帝王风范"

[Unique.A_InfiniteFreedom H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="无限自由"
mTooltip="英雄军队中所有没有相邻本方生物的本方生物获得+%buff1.buff.stat1.norm %buff1.buff.stat1.icon 移动力。"

[Unique.A_InfiniteFreedom_Buff_Increase H7BaseBuff]
mName="无限自由"
mTooltip=""

[Unique.A_Meditation H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冥想"
mTooltip="该英雄可以恢复全部 %icon_mana 法力。每周只能使用一次。"

[Unique.A_Meditation_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冥想"
mTooltip="该英雄可以补充其 %icon_mana 法力。每周只能使用一次。"

[Unique.A_Meditation_Buff H7BaseBuff]
mName="冥想"

[Unique.A_Obliteration H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="湮灭"
mTooltip="英雄军队中的所有生物在其第一个战斗回合中获得+%buff1.buff.stat.norm %icon_movement 移动力。"

[Unique.A_Obliteration_Buff H7BaseBuff]
mName="湮灭"
mTooltip="该生物在第一回合中获得+%stat.norm %icon_movement 移动力。"

[Unique.A_OpenMinded H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="思想开放"
mTooltip="该英雄每天获得与当前日期相对应的魔法学派加成。如果英雄在周中被雇佣，则该能力从新的一周开始。"

[Unique.A_OpenMinded_Buff_1 H7BaseBuff]
mName="阿什达"
mTooltip="该英雄施放 %icon_prime 源力法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_OpenMinded_Buff_2 H7BaseBuff]
mName="玛尔达"
mTooltip="该英雄施放 %icon_dark 暗系法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_OpenMinded_Buff_3 H7BaseBuff]
mName="艾尔达"
mTooltip="该英雄施放 %icon_light 光系法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_OpenMinded_Buff_4 H7BaseBuff]
mName="阿尔达"
mTooltip="该英雄施放 %icon_fire 火系法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_OpenMinded_Buff_5 H7BaseBuff]
mName="西拉达"
mTooltip="该英雄施放 %icon_earth 土系法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_OpenMinded_Buff_6 H7BaseBuff]
mName="莎尔达"
mTooltip="该英雄施放 %icon_water 水系法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_OpenMinded_Buff_7 H7BaseBuff]
mName="伊尔达"
mTooltip="该英雄施放 %icon_air 气系法术时拥有 %stat %stat.icon 魔力。"

[Unique.A_Perfectionist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="完美主义者"
mTooltip="每当英雄施放光系法术时，所有本方单位在当前回合结束前造成最大伤害。"

[Unique.A_Perfectionist_Buff H7BaseBuff]
mName="完美主义者"
mTooltip="该生物在当前回合结束前造成最大伤害。"

[Unique.A_Plunderer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="掠夺者"
mTooltip="该英雄每当赢得一场战斗时获得一项随机稀有资源。"

[Unique.A_PositionWar H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="阵地战"
mTooltip="在每次战斗开始时，英雄军队中的所有近战生物获得+%buff1.buff.stat.norm %icon_defense 防御力，直到它们移动。"

[Unique.A_PositionWar_Buff H7BaseBuff]
mName="阵地战"
mTooltip="该生物获得 %stat.norm %stat.icon 防御力，直到它移动。"

[Unique.A_ProtectorOfTheWeak H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="弱者保护者"
mTooltip="总督：在此城镇控制范围内的所有本方英雄获得 %buff1.buff.stat %buff1.buff.stat.icon 防御力。"

[Unique.A_ProtectorOfTheWeak_Buff H7BaseBuff]
mName="弱者保护者"
mTooltip="在此控制范围内 %stat %stat.icon 防御力"

[Unique.A_PrudentLeader H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="谨慎领袖"
mTooltip="英雄军队中的所有生物如果在该战斗回合中没有攻击，则为其下一回合获得+%buff1.buff.buff.buff.stat.norm %buff1.buff.buff.buff.stat.icon 攻击力。"

[Unique.A_PrudentLeader_Buff H7BaseBuff]
mName="谨慎领袖"
mTooltip="该生物获得 %stat.norm %stat.icon 攻击力，直到其下一回合结束。"

[Unique.A_PrudentLeader_Buff_Marker H7BaseBuff]
mName="谨慎领袖"

[Unique.A_Revengeful H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="复仇心切"
mTooltip="每个战斗回合中第一个攻击本方生物的敌方生物获得-%buff1.buff.buff1.buff.stat.norm %buff1.buff.buff1.buff.stat.icon 防御力，持续 %buff1.buff.buff1.buff.durini 回合。"

[Unique.A_Revengeful_Buff H7BaseBuff]
mName="复仇心切"
mTooltip="该生物获得 %stat %stat.icon 防御力，持续 %durnow 回合。"

[Unique.A_Revengeful_Buff_Prepare H7BaseBuff]
mName="复仇心切"
mTooltip=""

[Unique.A_Reviver H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="复活者"
mTooltip="该英雄获得法术 %spell 以在战斗中施放。此法术的效果随暗系魔法技能提升。"

[Unique.A_Reviver_AnimateDead_Spell H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="操纵死尸"
mTooltip="复活倒下的亡灵生物，最多 %d.min 生命值。"

[Unique.A_ShadowCommander H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影指挥官"
mTooltip="该英雄开局自带一个暗影潜伏者战争单位。此英雄军队中的暗影潜伏者获得 %buff.buff.stat1 %buff.buff.stat1.icon 攻击力和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性。"

[Unique.A_ShadowCommander_Buff H7BaseBuff]
mName="暗影指挥官"
mTooltip=""

[Unique.A_SonOfTheWolf H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狼群之子"
mTooltip="英雄军队中的所有生物使用%spell1.name能力后没有惩罚。"

[Unique.A_SpyMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="间谍大师"
mTooltip="间谍可以破坏和掠夺两个额外目标。"

[Unique.A_Spymaster_Player_Buff H7BaseBuff]
mName="间谍大师"
mTooltip="间谍可以破坏和掠夺两个额外目标。"

[Unique.A_SylvanPriestess_Spec H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="森林女祭司"
mTooltip="该英雄开局自带%spell.name法术。此法术以 %stat %stat.icon 魔力施放。与修女的关系也为英雄提供了一个治疗修女战争单位。"

[Unique.A_Untouchable H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="不可触及"
mTooltip="每当本方生物被笼罩时，他们可以受益于%spell.name能力。"

[Unique.A_WisdomOfAncestors H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="先祖智慧"
mTooltip="英雄军队中的生物在等待或防御时不会失去血怒。"

[CustomEffects.A_FireHeart H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰之心"
mTooltip="英雄在战斗中施放火系法术后，他在该战斗回合获得第二次行动机会。在此第二次行动中施放的法术将以 %buff1.buff.stat2 %ICON_MAGIC 魔力施放。"

UCP 1.3

[Unique.A_LightGuard H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光明守卫"
mTooltip="该英雄开局自带%spell1.name法术。此法术将在每次战斗开始时施放在所有本方小型生物上。"

[SpellSpecializations.A_EarthquakeSpecialist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="地动山摇专家"
mTooltip="本方生物对%spell1.name法术免疫。"

[Unique.A_LustForBlood H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="嗜血"
mTooltip="英雄军队中的所有生物（除了那些拥有%spell3.name能力和构造体）可以从活着的敌方生物吸取生命：他们的攻击回复等于造成伤害3%的生命值。这也复活倒下的生物。"

[Unique.A_Glamour H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魅力"
mTooltip="只要拥有%spell1.name增益，该英雄每天向此王国提供 %special %special.icon 星银。此增益也给予英雄+3 %icon_attack 攻击力。"

[Unique.A_Glamour_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魅力"
mTooltip="只要拥有%spell1.name增益，该英雄每天向此王国提供 %special %special.icon 星银。此增益也给予英雄+3 %icon_attack 攻击力。"

[Unique.A_AerialStorm H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="空中风暴"
mTooltip="此英雄施放的召唤元素法术总是召唤气元素。\n英雄军队中所有气元素的攻击也击中目标相邻的所有敌方生物。"

version 1.34

[Unique.A_FatherOfGolems H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔像之父"
mTooltip="该英雄有能力召唤目标魔像或砂岩魔像堆栈的 %special1.val2 %"

version 1.35

[Unique.A_ImperialPresence H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="帝王风范"
mTooltip="每当一个敌方生物死亡时，所有本方生物获得+%buff1.buff.buff.buff.stat.norm %buff1.buff.buff.buff.stat.icon 士气，直到其下一回合结束。"

[Unique.A_ImperialPresence_Buff H7BaseBuff]
mName="帝王风范"
mTooltip="+%stat.norm %stat.icon 士气，直到生物下一回合结束。"